public class Bear {
    private String name;

    public void setName(String name) {
        this.name = name;
    }
    public void tryEat(Ball ball) {
        System.out.println(name + "— Колобок, колобок! Я тебя съем.\n" +
                "\n" +
                "— Не ешь меня, косолапый! Я тебе песенку спою, — сказал колобок и запел:\n" +
                "\n" +
                "Я Колобок, Колобок!\n" +
                "\n" +
                "Я по коробу скребен,\n" +
                "\n" +
                "По сусеку метен,\n" +
                "\n" +
                "На сметане мешон,\n" +
                "\n" +
                "Да в масле пряжон,\n" +
                "\n" +
                "На окошке стужон;\n" +
                "\n" +
                "Я от дедушки ушел,\n" +
                "\n" +
                "Я от бабушки ушел,\n" +
                "\n" +
                "Я от зайца ушел,\n" +
                "\n" +
                "Я от волка ушел,\n" +
                "\n" +
                "И от тебя, медведь, не хитро уйти!\n" +
                "\n" +
                "И опять укатился, только медведь его и видел!\n" +
                "\n" +
                "Катится, катится «колобок, а навстречу ему лиса:!");
    }

}
