public class Fox {

        private String name;

        public void setName(String name) {
            this.name = name;
        }
        public void tryEat(Ball ball) {
            System.out.println(name + " — Здравствуй, колобок! Какой ты хорошенький. Колобок, колобок! Я тебя съем.\n" +
                    "\n" +
                    "— Не ешь меня, лиса! Я тебе песенку спою, — сказал колобок и запел:\n" +
                    "\n" +
                    "— Я Колобок, Колобок!\n" +
                    "\n" +
                    "Я по коробу скребен,\n" +
                    "\n" +
                    "По сусеку метен,\n" +
                    "\n" +
                    "На сметане мешон,\n" +
                    "\n" +
                    "Да в масле пряжон,\n" +
                    "\n" +
                    "На окошке стужон;\n" +
                    "\n" +
                    "Я от дедушки ушел,\n" +
                    "\n" +
                    "Я от бабушки ушел,\n" +
                    "\n" +
                    "Я от зайца ушел,\n" +
                    "\n" +
                    "Я от волка ушел,\n" +
                    "\n" +
                    "И от медведя ушел,\n" +
                    "\n" +
                    "А от тебя, лиса, и подавно уйду!\n" +
                    "\n" +
                    "— Какая славная песенка! — сказала лиса. — Но ведь я, колобок, стара стала, плохо слышу; сядь-ка на мою мордочку да пропой еще разок погромче.\n" +
                    "\n" +
                    "Колобок вскочил лисе на мордочку и запел ту же песню.— Спасибо, колобок! Славная песенка, еще бы послушала! Сядь-ка на мой язычок да пропой в последний разок, — сказала лиса и высунула свой язык; колобок прыг ей на язык, а лиса — ам его! И съела колобка…!");
        }
}
