public class Hare  {
    private String name;

    public void setName(String name) {
        this.name = name;
    }
    public void tryEat(Ball ball) {
        System.out.println(name + "— Колобок, колобок! Я тебя съем.\n" +
                "\n" +
                "— Не ешь меня, косой зайчик! Я тебе песенку спою, — сказал колобок и запел:\n" +
                "\n" +
                "Я Колобок, Колобок!\n" +
                "\n" +
                "Я по коробу скребен,\n" +
                "\n" +
                "По сусеку метен,\n" +
                "\n" +
                "На сметане мешон,\n" +
                "\n" +
                "Да в масле пряжон,\n" +
                "\n" +
                "На окошке стужон;\n" +
                "\n" +
                "Я от дедушки ушел,\n" +
                "\n" +
                "Я от бабушки ушел,\n" +
                "\n" +
                "И от тебя, зайца, не хитро уйти!\n" +
                "\n" +
                "И покатился себе дальше; только заяц его и видел!\n" +
                "\n" +
                "Катится колобок, а навстречу ему волк: !");
    }
}


